app/controllers/coords_controller.rb

INSERT INTO "coords" ("latitude", "longitude", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["latitude", "0.0"], ["longitude", "0.0"], ["user_id", 1], ["created_at", "2018-07-28 17:49:46.976996"], ["updated_at", "2018-07-28 17:49:46.976996"]]
---
  def create
    @user.coords << Coord.new(coord_params)

SELECT  "users".* FROM "users" WHERE "users"."uid" = $1 LIMIT $2  [["uid", "hivyanelly@gmail.com"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "hivyanelly@gmail.com"], ["LIMIT", 1]]
---
  def set_user
    if params[:user_id]
      @user = User.find(params[:user_id])
    elsif params[:user_email]
      @user = User.find_by(email: params[:user_email])